<!-- dflook/terraform-github-actions {"workspace":"default","backend":"fbcda82dea1cc984bc091b509f1bc966a09811cb1e928a07903b497f4cc986cf","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #283 at https://github.com/dflook/terraform-github-actions/actions/runs/3504722430","plan_hash":"4132cccf74c30e2bf4bfdf407444dfaa50f85a6f12fb6086a9cd822af43954c1","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "vTXjLcpWDm" -> (known after apply)
  ~ foreach = "6uZSST7OyB" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #283](https://github.com/dflook/terraform-github-actions/actions/runs/3504722430)